In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'col1':[4,7,6,9], 'col2':[45,34,45,56], 'col3':['abc','d','dfe','wd']})
df.head()

   col1  col2 col3
0     4    45  abc
1     7    34    d
2     6    45  dfe
3     9    56   wd

In [5]:
df['col2'].unique()
#Finding the unique values for all the values in column 2
#So if there is a repeat, it prints ir out only once

array([45, 34, 56], dtype=int64)

In [6]:
len(df['col2'].unique())
#Use len to know the count of the unique values in column 2

3

In [7]:
df['col2'].nunique()
#nunique(number of unique,n unique) is the same as using len

3

In [8]:
df['col2'].value_counts()
#The amount of times each value appears

45    2
34    1
56    1
Name: col2, dtype: int64

In [9]:
#Use conditional to select data in a df
df['col1']>6
#This prints the boolean value of all

0    False
1     True
2    False
3     True
Name: col1, dtype: bool

In [11]:
df[df['col1']>6]
#This prints out the True values only

   col1  col2 col3
1     7    34    d
3     9    56   wd

In [12]:
df[(df['col1']>6) & (df['col2']==56)]

   col1  col2 col3
3     9    56   wd

In [13]:
#A very simple function
def t2(x):
    return x*2

In [14]:
df['col1']

0    4
1    7
2    6
3    9
Name: col1, dtype: int64

In [15]:
df['col1'].sum()

26

In [16]:
df['col1'].mean()

6.5

In [17]:
#Then if you want to apply your own custom function instead
df['col1'].apply(t2)
#This will broadcast it to each element in the column

0     8
1    14
2    12
3    18
Name: col1, dtype: int64

In [18]:
df['col1'].apply(len)
#Can also use apply for built in functions too

TypeError: object of type 'int' has no len()

In [20]:
df['col3'].apply(len)
#apply with len(length) only work with strings

0    3
1    1
2    3
3    2
Name: col3, dtype: int64

In [21]:
df['col1'].apply(lambda x: x*2)
#Use the lambda expression to shorten the function, one line of code

0     8
1    14
2    12
3    18
Name: col1, dtype: int64

In [22]:
df.drop('col1',axis=1)
#IF we are dropping column then we have signify axis is equal to 1
#Dont forget inplace=True too

   col2 col3
0    45  abc
1    34    d
2    45  dfe
3    56   wd

In [23]:
df.columns
#To return/print the list of column names

Index(['col1', 'col2', 'col3'], dtype='object')

In [24]:
df.index
#Since its a range index it just returns it as start, stop and step

RangeIndex(start=0, stop=4, step=1)

In [25]:
df.sort_values(by='col2')
#df.sort_values('col2') is the same thing cuz it expect by to be the first parameter
#The index sticks with the column

   col1  col2 col3
1     7    34    d
0     4    45  abc
2     6    45  dfe
3     9    56   wd

In [26]:
df.sort_values(by='col2', ascending=False)

   col1  col2 col3
3     9    56   wd
0     4    45  abc
2     6    45  dfe
1     7    34    d

In [27]:
df.isnull()
#To check if there are no null values in your df
#Print out boolean values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [28]:
#Creating a pivot table
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [29]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [30]:
df.pivot_table(values='D', index=['A','B'], columns='C')
#Pivot Table has 3 main argument, values, index and columns, can be multiple too

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN